console.log('Chapter 21. Excercises');  // Skipped all exercises

//#region Chapter 21.1 Хранение на диске
// Сервер обмена опытом хранит данные исключительно в памяти. 
// Это означает, что в случае сбоя или перезапуска по любой 
// причине все разговоры и комментарии будут потеряны. 

// Дополните сервер так, чтобы он сохранял информацию о беседе на диск
// и автоматически перезагружал ее при перезапуске. Не беспокойтесь об
// эффективности - сделайте самое простое, лишь бы работало. 
console.log('=== Chapter 21.1 Хранение на диске');
//#endregion

//#region Chapter 21.2 Сброс поля комментариев 
// Полная повторная визуализация всех бесед работает довольно хорошо,
// потому что мы, как правило, не можем определить разницу между DОМ узлом 
// и его идентичной заменой. Но бывают исключения. Если начать чтото вводить 
// в поле комментария для беседы в одном окне браузера, а затем
// в другом добавить комментарий к этой беседе, то поле в первом окне будет
// визуализировано заново, так что пропадет и его содержимое, и фокус.

// Во время жаркой дискуссии, когда несколько человек добавляют комментарии 
// одновременно, это будет раздражать. Можете ли вы придумать способ
// решить такую проблему? 
console.log('=== Chapter 21.2 Сброс поля комментариев ');
//#endregion